Criando um Dataframe "from scratch"

In [1]:
import pandas as pd

In [8]:
df=pd.DataFrame([[1,7,1],[2,6,0],[4,9,1],[3,4,0],[2,11,0],[9,16,1]])

In [9]:
#mostra as primeiras linhas do DataFrame
df.head()

   0   1  2
0  1   7  1
1  2   6  0
2  4   9  1
3  3   4  0
4  2  11  0

In [12]:
#crie o nome das colunas (tempo, salário e clt ou não)
df.columns=['tempo','salário','clt']
df.head()

   tempo  salário  clt
0      1        7    1
1      2        6    0
2      4        9    1
3      3        4    0
4      2       11    0

In [14]:
#mostre a série salário
df['salário']

0     7
1     6
2     9
3     4
4    11
5    16
Name: salário, dtype: int64

In [15]:
#observe que há um índice default (0,1....) no DataFrame

Acessando elementos com .loc (índice, série) ou .iloc(linha,coluna)

In [17]:
#acesse a segunda coluna da terceira linha com .iloc
df.iloc[2,1]

9

In [19]:
#acesse salário de índice 4
df.loc[4,'salário']

11

In [20]:
#Para alterar elementos, prefira o .iloc...mude o salário de 11 para 14
df.iloc[4,1]=14
df

   tempo  salário  clt
0      1        7    1
1      2        6    0
2      4        9    1
3      3        4    0
4      2       14    0
5      9       16    1

In [21]:
#filtros: mostre as amostras com salários acima de 4k
filtro=df['salário']>4
df[filtro]

   tempo  salário  clt
0      1        7    1
1      2        6    0
2      4        9    1
4      2       14    0
5      9       16    1

In [22]:
filtro

0     True
1     True
2     True
3    False
4     True
5     True
Name: salário, dtype: bool

In [23]:
#Aumente o salário de todos em 10%
df['salário']=1.1*df['salário']
df

   tempo  salário  clt
0      1      7.7    1
1      2      6.6    0
2      4      9.9    1
3      3      4.4    0
4      2     15.4    0
5      9     17.6    1